import { LuNotebookPen } from "react-icons/lu";

const TripIncludes = ({ data }) => {
  return (
    <div>
      <div className="border rounded-lg">
        <div className="border-b">
          <div className="flex items-center gap-2 p-3">
            <div className="bg-[#ECF1F8] p-2 rounded-lg">
              <LuNotebookPen className="text-[#3F72B7]" size={20} />
            </div>
            <span className="text-[#3F72B7] font-semibold">โน้ต</span>
          </div>
        </div>
        <div className="p-3 overflow-hidden">
          {/* หัวข้อทริป
          <h2 className="text-3xl font-semibold flex items-center gap-2 mt-4 text-black">
            ราคา 68,900 บาท
          </h2>
          <p className="text-black text-base mt-1">
            วางมัดจำ 30,000 บาท ค่าทริปส่วนที่เหลือชำระก่อนเดินทาง 60 วัน
            <br />
            หลังจากโอนมัดจำเพื่อจองสิทธิ์เรียบร้อยแล้ว
            โปรดส่งหลักฐานและข้อมูลดังต่อไปน
          </p>
          <p className="text-black text-sm mt-1">
            หลักฐานการโอนเงินมาที่ช่องทางแชทที่ติดต่อไว้ หน้าพาสปอร์ต
            <br />
            (โปรดตรวจสอบ หนังสือเดินทางต้องมีอายุเหลืออย่างน้อย 6 เดือน)
            <br />
            กรอกแบบฟอร์มข้อมูลส่วนตัวที่บริษัทส่งให้
          </p>
          <p className="text-black text-sm mt-1">
            ค่าบริการนี้รวม ค่าที่พัก 5 คืน
            <br />
            ค่าใช้จ่ายเกี่ยวกับรถที่ใช้ในการเดินทางทั้งหมด
            <br />
            ค่าบริการสต๊าฟช่างภาพมืออาชีพ นำทริป ถ่ายภาพ
            <br />
            และแต่งรูปส่งให้ลูกค้าทุกวัน ค่า Aurora Watching Tour
            <br />
            พาทุกท่านออกล่าแสงเหนือในทุกคืนที่มีแสงเหนือ
            <br />
            ค่าประกันอุบัติเหตูการเดินทาง วงเงินคุ้มครองไม่เกิน 2,000,000
            <br />
            บาทเงื่อนไขตามกรมธรรม
          </p>
          <p className="text-black text-sm mt-1">
            ค่าบริการนี้ไม่รวม
            <br />
            ตั๋วเครื่องบินระหว่างประเทศ/ภายในประเทศ
            <br />
            ค่าทำเนียมวีซ่า และศูนยื่นวีซ่า vfs
            <br />
            ค่าตรวจ PCR Test ในกรณีที่สายการบินมีข้อกำหนดให้มีผลตรวจแสดง ณ
            จุดเช็คอิน (ถ้ามี)
            <br />
            ค่าทิปพนักงานบริการ (ถ้ามี)
            <br />
            ค่าใช้จ่ายส่วนตัวอื่นๆ นอกเหนือที่ระบุไปเบื้องต้น เช่น ค่า SIM CARD
            ค่าเครื่องดื่ม มินิบาร์ ค่าโทรศัพท์ ค่าซักรีด เป็นต้น
            <br />
            อัตราค่าบริการดังกล่าวไม่รวมค่าใช้จ่ายส่วนตัว ค่าน้ำหนักกระเป๋าเกิน
            ค่าอาหารที่สั่งเพิ่มพิเศษ
            ค่าใช้จ่ายที่เกิดขึ้นจากความเสียหายของตัวบุคคล
            และค่าใช้จ่ายที่เกิดจากความล่าช้าของสายการบิน อุบัติเหตุ และสงคราม
            <br />
            ค่าใช้จ่ายอื่นๆ ที่อาจเกิดขึ้นโดยไม่ได้คาดการณ์
          </p>
          <p>
            *** ทางบริษัทมีบริการจองตั๋วเครื่องบินให้ลูกค้า โดยมีค่าบริการ 300
            บาท/ตั๋วเครื่องบิน ***
          </p>
          <p>
            เที่ยวบินระหว่างประเทศ : 7MAR24 QR833 BKK-OSL: 20.25-06.45 +1 //
            13MAR24 QR176 OSL-BKK: 14.50-12.05
            <br />
            ที่ยวบินภายในประเทศ : 8MAR24 SK4106 OSL-LKN: 10.40-13.10 // 13MAR24
            WF805 LKN-OSL: 05.40-08.25 +1
          </p>
          <p>
            บริษัทให้สิทธิ์ลูกค้าเลือกเที่ยวบินที่ถึงเวลาใกล้เคียงกันได้ตามสะดวก
            (รบกวนปรึกษาเจ้าหน้าที่ก่อนจองทุกครั้ง!)
            <br /> ลูกค้าตัดสินใจเองว่าจะซื้อตั๋วเครื่องบินตอนไหน
            ก่อนหรือหลังวีซ่าออก
          </p>
          <p>***ทางเราจะไม่รับผิดชอบในกรณีที่ราคาตั๋วเครื่องบินขึ้น***</p>
          <p>
            การยกเลิกทริป
            <br />
            ยกเลิกก่อน 60 วัน คืนมัดจำ 50%
            <br />
            ยกเลิกหลัง 60 วัน สงวนสิทธิ์ในการคืนมัดจำ และค่าทริปทุกกรณี
            <br />
            หากยกเลิกโดยลูกค้าขอสงวนสิทธิ์นการคืนมัดจำทั้งหมด
          </p>
          <p>
            ______________________________________________________________________________________________________________________________________
          </p>
          <p>
            เงื่อนไขนอกการรับผิดชอบ
            <br />
            บริษัท จะไม่รับผิดชอบในทุกกรณี ถ้าวีซ่าลูกค้าไม่ผ่าน บริษัทฯ
            รับเฉพาะผู้มีวัตถุประสงค์เดินทางเพื่อท่องเที่ยวเท่านั้น
            <br />
            การเดินทางของผู้เดินทางด้วยวัตถุประสงค์แอบแฝงอื่น ๆ เช่น
            การไปค้าแรงงาน การค้าประเวณี การค้ามนุษย์ การขนส่งสินค้าหนีภาษี
            การขนยาเสพติด
            <br /> การโจรกรรม การขนอาวุธสงคราม การก่อการร้าย และ อื่น ๆ
            ที่เข้าข่ายผิดกฏหมาย ผิดศีลธรรมอันดี บริษัทฯ มิได้มีส่วนรู้เห็น
            เกี่ยวข้อง หรือ
            <br /> มีส่วนต้องรับผิดชอบใด ๆ กับการกระทำดังกล่าวทั้งสิ้น
            <br />
            หากผู้เดินทางถูกเจ้าหน้าที่ตรวจคนเข้าเมืองของประเทศนั้นๆ
            ปฏิเสธการเข้า - ออกเมือง ด้วยเหตุผลใดๆ ก็ตาม
            ถือเป็นเหตุผลซึ่งอยู่นอกเหนืออำนาจ
            <br /> และความรับผิดชอบของบริษัทฯ ทางบริษัทฯ
            ขอสงวนสิทธิ์ที่จะไม่รับผิดชอบคืนเงินทั้งหมด
            <br />
            บริษัทฯ
            จะไม่รับผิดชอบในกรณีที่กองตรวจคนเข้าเมืองของประเทศไทยงดออกเอกสารเข้าเมืองให้กับชาวต่างชาติ
            หรือ
            <br /> คนต่างด้าวที่พำนักอยู่ในประเทศไทย
            แต่จะทำหน้าที่ช่วยเหลือเจรจา
            แต่อำนาจสิทธิ์ขาดเป็นของทางกองตรวจคนเข้าเมือง
            <br />
            ผู้เดินทางต้องใช้วิจารณญาณส่วนตัวและรับผิดชอบต่อการตัดสินใจในการเลือกซื้อสินค้าต่าง
            ๆ ในระหว่างการเดินทางท่องเที่ยวด้วยตัวท่านเอง บริษัทฯ
            <br />
            จะไม่สามารถรับผิดชอบใด ๆ
            หากเกิดความไม่พึงพอใจในสินค้าที่ผู้เดินทางได้ซื้อระหว่างการเดินทางท่องเที่ยวนี้
            <br />
            ผู้เดินทางต้องรับผิดชอบต่อการจัดเก็บ และ ดูแลทรัพย์สินส่วนตัว
            ของมีค่าต่าง ๆ อย่างระมัดระวัง บริษัทฯ จะไม่สามารถรับผิดชอบใด ๆ
            <br />
            หากเกิดการสูญหายของ ทรัพย์สินส่วนตัว ของมีค่าต่าง ๆ
            ระหว่างการเดินทางท่องเที่ยว อันมีสาเหตุมาจากผู้เดินทาง
            <br /> บริษัทฯ จะไม่รับผิดชอบต่อการสูญหายของทรัพย์สิน และ
            สัมภาระระหว่างการเดินทางอันมีสาเหตุมาจากสนามบิน สายการบิน
            บริษัทขนส่ง โรงแรม หรือ
            <br /> การโจรกรรม
            แต่จะทำหน้าที่เป็นตัวแทนในการเรียกร้องค่าชดใช้ให้กับผู้เดินทาง
            บริษัทฯ
            ขอสงวนสิทธิ์ที่จะไม่รับผิดชอบค่าเสียหายในเหตุการณ์ที่เกิดจากการยกเลิกหรือความล่าช้าของสายการบิน
            ภัยธรรมชาติ การนัดหยุดงาน การจลาจล
            <br /> การปฏิวัติ รัฐประหาร ที่อยู่นอกเหนือการควบคุมของทางบริษัทฯ
            หรือ ค่าใช้จ่ายเพิ่มเติมที่เกิดขึ้นทางตรงหรือทางอ้อม เช่น
            การเจ็บป่วย การถูกทำร้าย
            <br /> การสูญหาย ความล่าช้า หรือ จากอุบัติเหตุต่างๆ บริษัทฯ
            ขอสงวนสิทธิ์ที่จะไม่รับผิดชอบใด ๆ ต่อการไม่เป็นไปตามความคาดหวัง
            <br />
            และความไม่พึงพอใจของผู้เดินทาง ที่เกี่ยวข้องกับ สภาพธรรมชาติ
            ภูมิอากาศ ฤดูกาล ทัศนียภาพ วัฒนธรรม
            <br />
            วิถีและพฤติกรรมของประชาชนในประเทศที่เดินทางไป
          </p> */}
          {data ? (
              <div
                dangerouslySetInnerHTML={{ __html: data }}
              ></div>
            ) : (
              <>
                <span>ไม่มีข้อมูล</span>
              </>
            )}
        </div>
      </div>
    </div>
  );
};

export default TripIncludes;
